test/fixtures/compositions/GetCategories.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:alanbushtrust-org-uk:soap.methods">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:GetCategories/>
   </soapenv:Body>
</soapenv:Envelope>
